import React, { useState } from "react";
//
import firebase from "firebase";
//
import Register from "./vues/register";
import User from "./vues/User";
import Login from "./vues/Login";
//
import { NavigationContainer } from "@react-navigation/native";
import { createMaterialTopTabNavigator } from "@react-navigation/material-top-tabs";
//
const Tab = createMaterialTopTabNavigator();
//
export default function App() {
  const [screen, setScreen] = useState(null);
  // Pour les tests:
  /* const [screen, setScreen] = useState("tex.avery@gmail.com"); */
  /* const [screen, setScreen] = useState("bugs.bunny@gmail.com"); */
  /* const [screen, setScreen] = useState("daffy.duck@gmail.com"); */
  // Méthode pour mettre à jour le useState screen:
  const returnLoginScreen = () => {
    return <Login updateScreen={setScreen} />;
  };
  // Si on est pas connecté accès aux pages login et création de compte:
  if (screen === null) {
    return (
      <NavigationContainer>
        <Tab.Navigator>
          <Tab.Screen name="Login">{returnLoginScreen}</Tab.Screen>
          <Tab.Screen name="Register" component={Register} />
        </Tab.Navigator>
      </NavigationContainer>
    );
  } else {
    // Si on est connecté accès à la page des utilisateurs:
    return <User userConnecte={screen} />;
  }
}
// Your web app's Firebase configuration:
const firebaseConfig = {
  apiKey: "AIzaSyA6o-bZ7YDLEmKjo1Vj68AnQemOVw8soIA",
  authDomain: "messagerie-fe70a.firebaseapp.com",
  projectId: "messagerie-fe70a",
  storageBucket: "messagerie-fe70a.appspot.com",
  messagingSenderId: "471357990083",
  appId: "1:471357990083:web:a878ae81c2249a49166e76",
};
// Initialize Firebase:
const app = firebase.initializeApp(firebaseConfig);
/*
àààààààààààààààààààààààààààààààààààààààEàààààààààµ$µàààEEEààààµ$µ$($EààààEEEàààààààààààààààààààààààààààààààààààààààààààà
ààààààààààààààààààààààààààààààààààààµààEàààEµ$($(($($µµµ(/////((//(µµµ$$$$$$$µµ$µEEµEààààààààààààààààààààààààààààààààààà
àààààààààààààààààààààààààààààààààààµµàààµ$$$/$(/(((((/////($(/($$$////o/$$((((((µµµµ$Eµ$µààààààààààààààààààààààààààààààà
àààààààààààààààààààààààààààààààààE$ààE$µ$$/$//o(($(//(//((//($$(/((((/o///(($$µààµ/o/$µ$(µ((àààààààààààààààààààààààààààà
ààààààààààààààààààààààààààààààààEµà$$(µ((////(((////o((//($/oo///////((/($$$(((((($((($$/($$µ(àààààààààààààààààààààààààà
àààààààààààààààààààààààààààààààµµ($$$$(////(/(///(///(o/$o(/,,,,oo(/o($(//((((($$$//(àE(Eµ$µ$Eµ(àààààààààààààààààààààààà
ààààààààààààààààààààààààààààààµE(µµ($(/$/(o(o/o(///(//(o//o,,,o/(/($((/$(/$ààµEàààEàà(/àµµ$Eà$µà(Eàààààààààààààààààààààà
ààààààààààààààààààààààààààààààE((µ($(o(((/(o/o$///(o/(o/o,.,,/((//$$oo($Eµààààààààààààà$/$EEàà$µE(àààààààààààààààààààààà
ààààààààààààààààààààààààààààààE$(µ((//(/(//o/(o/($//$ooo,,,oo/((/((//$$$/oo(ààààààààààààµE(µààµààµEààààààààààààààààààààà
ààààààààààààààààààààààààààààààà$($/(o////((//o//$$/((//oo,,,/(/$((, .  .,,o(µEààààààààààààE$EEàààààààààààààààààààààààààà
àààààààààààààààààààààààààààààààE////o(o//(/(((((µ(($(($((ooo/,            ./$µEààààààààààààµàEEààààààààààààààààààààààààà
ààààààààààààààààààààààààààààààààE///o/o///($$((oo,/($$$$$$o     ........   .,(EààààààààààààààEàààààààààààààààààààààààààà
ààààààààààààààààààààààààààààààààà$/////ooo.        ...oµµµµ$($(/////o,,......,/µµµàààààààààààààààààààààààààààààààààààààà
ààààààà(((($$$µµEEEEµ$(µàààààààààE(/o,.       .ooo//(µµµµµµµµµ$o./($($$((o,......(àààààààààààààààààààààààààààààààààààààà
ààààà((((((($$$$$(($$µµµµµEEEEµ$$/(/..      ,oo//$$µµµµµµµµµµµ$o,o,.         .o.../$àààààààààààààààààààààààààààààààààààà
àààà(((//(,.............o/($µ$µµEµ$,.     ,o((($$o,o  . .($µµµµ$,    o(o      ,/o,.,oààààààààààààààààààààààààààààààààààà
àààà((//,...  /(((($µ/.. ....o($$(o.    .,o$($$o,.       .µ$µµµµµ$µµ$$$$/($$µ$µ(/o,,,,µààààààààààààààààààààààààààààààààà
ààààà$((/(,..  .o/(($$/        /$(/.    .,($$$,      // .oµµµ$$$((($(((($$$$$$$$(o/,.,.(àààààààààààààààààààààààààààààààà
àààààààE/(/oo/o..               (/,     ,/$$$o.     .(,o$$$(/($$µ$$$$$$$µ$$((((((((oo,.,(ààààààààààààààààààààààààààààààà
àààààààààà////o,o.  .//,..      /(..   ..(($(.   .,(($$((/((($$$$$$$$$($$$$$$$$$$$$$$/o/,oàààààààààààààààààààààààààààààà
àààààààààààà(/////,. ($$$o...  /$(/,,,,,o($$$$$$$$(/(((/(((($$$$$$$(((($$$$$$$$(///((((((((($ààààààààààààààààààààààààààà
àààààààààààààEo/(/o,. /$µ$(.     ooooo/o/(($$((/////((/($(($$$$$$($(($$$$$µ$(//((($($$$$$$$$$(//µààààààààààààààààààààààà
ààààààààààààààà/($(/,  .($/,  ..,///ooooo//($$//oooooo($($$$$($(/$((($$$$$//(((($$$$$$$$$$$((/////$ààààààààààààààààààààà
àààààààààààààààà(/((/o.     ,/(($(/oooooo/($($(//ooo,/$$(($($$(/$(((($$$$(/(($$$$$$$$$$$$(//////(/oo./àààààààààààààààààà
ààààààààààààààààà//($//,    o$$$$(///ooo/(($$$$(/o,,,($(((($$(/(((($$$$$(/($$($$$$$$(($$$$$$$$$$((//oo,/àààààààààààààààà
àààààààààààààààààà//((///,...o/(µ((//,o/((($$$$$(/,,,($((($$$/($(($($$$$/($(($$$$$$(($$$µ$$$$$$$,,(((/o,.µàààààààààààààà
ààààààààààààààààààµ//($$((/o/oo$µ$$(oo((((($$$$$$(/oo($((($$(/(((($($$$(/(((($$$$$(($$µµµµµµµ$$$,  ,(/oo,.µààààààààààààà
ààààààààààààààààààà$/(($$/oooo$µ$$µ/o/(((($($$$$$$(/o($((($$/((((($$$$$o((($$$$$$$(($$$.  ,µµµ$$µ.  ,//oo,.ààààààààààààà
ààààààààààààààààààààµ($$$$$((($$µE$,//((((((($($($((o/$(($($/(((($($$$$o(((($$$$$µ(($$$.   .,µµ$$$. ./(/oo.oàààààààààààà
ààààààààààààààààààààà$/(µµµ$$$µEEµo,///((((($($($($(/o$(((($/(((((($$$(o((((($$$$$/($$$$    ./$$$$$,,///oo..àààààààààààà
ààààààààààààààààààààààE(/($$EµEµ(o/.////(((((((($$($(/((((($/((((((($$$o(((($$($$$((($$$$(. .$$$$$$(/,/ooo..àààààààààààà
ààààààààààààààààààààààà$///,...,/((.o////(((((((((((((/(((($$/((((($$$$/(((((($$$$µ/(($$$$$µ$$$$$(((//ooo,.,àààààààààààà
àààààààààààààààààààààà$$(oo///((o(/o,oo////((((((((((((/(((($/((((((($$(((((($$$$$$$/o/(/($((((((((//oo,.,.oàààààààààààà
ààààààààààààààààààààààE$/oo/(///o(o/,,o/oo//((((((((((((/o((($,/((((($$$,/((($$$$$$$$/oo//////////ooo,,,.  µàààààààààààà
ààààààààààààààààààààààà$(,,/o/////oo/o,ooo/o///(/((((((/o,.,/(/..,ooooo,  .o/((($$$$$(,o,o///oooo,o,..   .µààààààààààààà
ààààààààààààààààààààààµE(o,oo/ooooo,(oo,ooo///o////(/(/oo.                      .//(/(/o.o,,..         o(o$Eàààààààààààà
ààààààààààààààààààààààEµ/o,,///o,/o/oo(/oooo,ooo///ooo,..   .                     /Eàààà  .      .,..,oo(µ$ààààààààààààà
ààààààààààààààààààààààµ$(o.,o(ooooo((,o//(/o,,........ .,oo($$/o..                  .($.   ...    o,,,o//(((µààààààààààà
ààààààààààààààààààààààà(/,,,o//o,ooo/oo,//$((///oo,o/o/(/($$$($µ$µ.                          ,EE(,((oo/oo//Eàààààààààààà
ààààààààààààààààààààààµµ/o,,,..,,o,,(,oo,o(($(//o/o/o(///(($/((($µ$µ$.    ..             .  .Eààà$E$$$$(//,..(µààààààààà
ààààààààààààààààààààààà(o,o,,.......,,.o,o(oo/o,o//(oo,o,,oo//(/((($$µE$o.  $ààà$            oEEµµ$((//,/o,. ...,///($$µ
ààààààààààààààààààààààà(//o,,,..,,,,....,o,oo//ooo.(//.o/ooooo/(((($$$µ$µµµEEEààào           /µ$$((($(ooo,            ..
ààààààààààààààààààààààE$///((////,/o,,,o,,/o/o/,/o.,/,/o/. .oooo,o/o(((($$($$$µEEEµ$/((µµµµ$µ$($(((/$(/..,,            à
ààààààààààààààààààààààµE$((o(///(//o/oo,///ooo/,,,,,oooo/,.(,,,,..,o//(o((($$$$($$($$$$$$$($($$((///ooo.  ..            
àààààààààààààààààààààààEµ((/(o(o(///o/((////,oo,,,oo,oo/o//o/,./.o...ooo,,/,/($$$$$$$$$$$($$$$o(o,oo..                  
àààààààààààààààààààààààEEµ(o(,////,//o(/o/((,o,,/oo/,o/,//(((//o/o........oooo/o,/o/(,(/oo//o/(,,.     GEGEALF          
àààààààààààààààààààààààEEµ$((o(/(/o/o,////(/oooo,////o///(/o//o/./,,,,,,......,,,,,o,/.     . ..         ..         .   

*/
